app/Controllers/DessertController.php

SELECT *
FROM `dessert`
---
    public function index()
    {
        $data = [
            'title' => 'Dessert Management',
            'page_title' => 'Dessert List',
            'desserts' => $this->DessertModel->findAll()