app/Controllers/DrinkController.php

SELECT `drink`.*, `kategori`.`kategori_minuman`
FROM `drink`
JOIN `kategori` ON `kategori`.`id` 
            = `drink`.`kategori_minuman_id`
---
    public function index()
    {
        $data = [
            'title' => 'Drink Management',
            'page_title' => 'Drink List',
            'drinks' => $this->DrinkModel->select('drink.*,kategori.kategori_minuman')->join('kategori','kategori.id
            = drink.kategori_minuman_id')->findAll(),