app/Controllers/Heavy_MealController.php

SELECT *
FROM `heavy_meal`
---
    public function index()
    {
        $data = [
            'title' => 'Heavy Meal Management',
            'page_title' => 'Heavy Meal List',
            'heavy_meals' => $this->Heavy_MealModel->findAll()