app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data = [
            'title' => 'Kategori Management',
            'page_title' => 'Kategori List',
            'kategoris' => $this->KategoriModel->findAll()